app/controllers/categories_controller.rb

  def index
    @all_categories = Category.find(:all, :order=>"name")
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)