app/controllers/photos_controller.rb

  def show
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)

  def edit
    @photo = Photo.find(params[:id])
    @all_categories = Category.find(:all, :order=>"name")
    @selected = @photo.categories.collect { |cat| cat.id.to_i }
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 0)
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `categories` INNER JOIN `categories_photos` ON `categories`.id = `categories_photos`.category_id WHERE (`categories_photos`.photo_id = 1 )