app/controllers/slideshows_controller.rb

SELECT * FROM `slideshows` LIMIT 0, 10
---
  def index
    @slideshows = Slideshow.search(params[:page])

SELECT * FROM `slideshows` WHERE (`slideshows`.`id` = 1)
---
  def show
    @slideshow = Slideshow.find(params[:id])

SELECT * FROM `slideshows` WHERE (`slideshows`.`id` = 1)
---
  def edit
    @slideshow = Slideshow.find(params[:id])

UPDATE `slides` SET `position` = 0 WHERE `id` = 4
---
  def update_slide_order
    params[:sortable_thumbs].each_with_index do |id, position|
      Slide.update(id, :position => position)

DELETE FROM `slides` WHERE (`id` IN ('3'))
SELECT * FROM `slideshows` WHERE (`slideshows`.`id` = 1)
---
  def remove_slide
    slideshow_id = session[:slideshow].id
    slide_id = params[:id].split("_")[1]
    Slide.delete(slide_id)
    @slideshow = Slideshow.find(slideshow_id)